src/cf/Enums/ФлагиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФлагиОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Красный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Желтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лиловый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФлагиОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет индекс картинки флага в коллекции КоллекцияФлаговПисем.
//
// Параметры:
//  Флаг - ПеречислениеСсылка.ФлагиОбъектов - Флаг.
// 
// Возвращаемое значение:
//  Число - Индекс картинки файла.
//
Функция ИндексКартинкиФлага(Флаг) Экспорт
	
	Если Флаг = Красный Тогда
		Возврат 1;
	ИначеЕсли Флаг = Синий Тогда
		Возврат 2;
	ИначеЕсли Флаг = Желтый Тогда
		Возврат 3;
	ИначеЕсли Флаг = Зеленый Тогда
		Возврат 4;
	ИначеЕсли Флаг = Оранжевый Тогда
		Возврат 5;
	ИначеЕсли Флаг = Лиловый Тогда
		Возврат 6;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Определяет индекс картинки флага в коллекции КоллекцияГруппировкиЗадач.
//
// Параметры:
//  Флаг - ПеречислениеСсылка.ФлагиОбъектов - Флаг.
// 
// Возвращаемое значение:
//  Число - Индекс картинки файла.
//
Функция ИндексКартинкиГруппировки(Флаг) Экспорт
	
	Если Флаг = Красный Тогда
		Возврат 3;
	ИначеЕсли Флаг = Синий Тогда
		Возврат 4;
	ИначеЕсли Флаг = Желтый Тогда
		Возврат 5;
	ИначеЕсли Флаг = Зеленый Тогда
		Возврат 6;
	ИначеЕсли Флаг = Оранжевый Тогда
		Возврат 7;
	ИначеЕсли Флаг = Лиловый Тогда
		Возврат 8;
	Иначе
		Возврат 2;
	КонецЕсли;
	
КонецФункции

// Возвращает картинку для флага
//
// Параметры:
//  Флаг - ПеречислениеСсылка.ФлагиОбъектов - Флаг.
// 
// Возвращаемое значение:
//  Картинка - Картинка флага.
//
Функция КартинкаФлага(Флаг) Экспорт
	
	Если Флаг = Красный Тогда
		Возврат БиблиотекаКартинок.КрасныйФлаг;
	ИначеЕсли Флаг = Синий Тогда
		Возврат БиблиотекаКартинок.СинийФлаг;
	ИначеЕсли Флаг = Желтый Тогда
		Возврат БиблиотекаКартинок.ЖелтыйФлаг;
	ИначеЕсли Флаг = Зеленый Тогда
		Возврат БиблиотекаКартинок.ЗеленыйФлаг;
	ИначеЕсли Флаг = Оранжевый Тогда
		Возврат БиблиотекаКартинок.ОранжевыйФлаг;
	ИначеЕсли Флаг = Лиловый Тогда
		Возврат БиблиотекаКартинок.ЛиловыйФлаг;
	Иначе
		Возврат БиблиотекаКартинок.ПустойФлаг;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
